testing/jmeter/reports/report-10vu/statistics.json
{
  "GET Landing Page" : {
    "transaction" : "GET Landing Page",
    "sampleCount" : 9,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 250.33333333333337,
    "medianResTime" : 120.0,
    "minResTime" : 64.0,
    "maxResTime" : 837.0,
    "pct1ResTime" : 837.0,
    "pct2ResTime" : 837.0,
    "pct3ResTime" : 837.0,
    "throughput" : 1.0901162790697674,
    "receivedKBytesPerSec" : 28.439898823582848,
    "sentKBytesPerSec" : 0.18842830214389533
  },
  "GET Login Page" : {
    "transaction" : "GET Login Page",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 337.90000000000003,
    "medianResTime" : 137.0,
    "minResTime" : 32.0,
    "maxResTime" : 1007.0,
    "pct1ResTime" : 979.6000000000001,
    "pct2ResTime" : 1007.0,
    "pct3ResTime" : 1007.0,
    "throughput" : 1.0711225364181662,
    "receivedKBytesPerSec" : 9.446589478898886,
    "sentKBytesPerSec" : 0.9466463822836332
  },
  "GET Klien Dashboard" : {
    "transaction" : "GET Klien Dashboard",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2502.0,
    "medianResTime" : 2470.5,
    "minResTime" : 2437.0,
    "maxResTime" : 2631.0,
    "pct1ResTime" : 2625.2,
    "pct2ResTime" : 2631.0,
    "pct3ResTime" : 2631.0,
    "throughput" : 0.8173941474579042,
    "receivedKBytesPerSec" : 28.96640510053948,
    "sentKBytesPerSec" : 0.7303863719960765
  },
  "POST Login Klien-0" : {
    "transaction" : "POST Login Klien-0",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1268.3,
    "medianResTime" : 1186.5,
    "minResTime" : 973.0,
    "maxResTime" : 1644.0,
    "pct1ResTime" : 1643.8,
    "pct2ResTime" : 1644.0,
    "pct3ResTime" : 1644.0,
    "throughput" : 0.9169264624977076,
    "receivedKBytesPerSec" : 1.6646155212726939,
    "sentKBytesPerSec" : 0.9742343664038143
  },
  "POST Login Klien-1" : {
    "transaction" : "POST Login Klien-1",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 944.0,
    "medianResTime" : 804.0,
    "minResTime" : 735.0,
    "maxResTime" : 1540.0,
    "pct1ResTime" : 1513.8000000000002,
    "pct2ResTime" : 1540.0,
    "pct3ResTime" : 1540.0,
    "throughput" : 0.9435742592942065,
    "receivedKBytesPerSec" : 1.740636499811285,
    "sentKBytesPerSec" : 0.8376064469711265
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 69,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1837.347826086957,
    "medianResTime" : 1488.0,
    "minResTime" : 32.0,
    "maxResTime" : 5617.0,
    "pct1ResTime" : 4587.0,
    "pct2ResTime" : 4996.0,
    "pct3ResTime" : 5617.0,
    "throughput" : 4.113754247898409,
    "receivedKBytesPerSec" : 87.00419060767305,
    "sentKBytesPerSec" : 4.543260094348059
  },
  "POST Login Klien-2" : {
    "transaction" : "POST Login Klien-2",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2593.4,
    "medianResTime" : 2498.5,
    "minResTime" : 2415.0,
    "maxResTime" : 3254.0,
    "pct1ResTime" : 3208.6000000000004,
    "pct2ResTime" : 3254.0,
    "pct3ResTime" : 3254.0,
    "throughput" : 0.8155276463872125,
    "receivedKBytesPerSec" : 28.900260968846844,
    "sentKBytesPerSec" : 0.7287185512151362
  },
  "POST Login Klien" : {
    "transaction" : "POST Login Klien",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 4806.799999999999,
    "medianResTime" : 4889.5,
    "minResTime" : 4181.0,
    "maxResTime" : 5617.0,
    "pct1ResTime" : 5579.400000000001,
    "pct2ResTime" : 5617.0,
    "pct3ResTime" : 5617.0,
    "throughput" : 0.7027406886858749,
    "receivedKBytesPerSec" : 27.475513879128602,
    "sentKBytesPerSec" : 1.9984188334504567
  }
}