testing/jmeter/reports/report-20vu/statistics.json
{
  "GET Landing Page" : {
    "transaction" : "GET Landing Page",
    "sampleCount" : 20,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1458.1999999999998,
    "medianResTime" : 1445.0,
    "minResTime" : 195.0,
    "maxResTime" : 3759.0,
    "pct1ResTime" : 2136.6,
    "pct2ResTime" : 3677.999999999999,
    "pct3ResTime" : 3759.0,
    "throughput" : 0.9337068160597572,
    "receivedKBytesPerSec" : 24.358669248949578,
    "sentKBytesPerSec" : 0.1613926820728291
  },
  "GET Login Page" : {
    "transaction" : "GET Login Page",
    "sampleCount" : 20,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 884.4000000000001,
    "medianResTime" : 959.0,
    "minResTime" : 48.0,
    "maxResTime" : 2618.0,
    "pct1ResTime" : 2062.8,
    "pct2ResTime" : 2590.2999999999997,
    "pct3ResTime" : 2618.0,
    "throughput" : 0.971534052268532,
    "receivedKBytesPerSec" : 8.568285181676869,
    "sentKBytesPerSec" : 0.858631169241232
  },
  "GET Klien Dashboard" : {
    "transaction" : "GET Klien Dashboard",
    "sampleCount" : 20,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3683.1499999999996,
    "medianResTime" : 3656.0,
    "minResTime" : 2680.0,
    "maxResTime" : 4541.0,
    "pct1ResTime" : 4445.3,
    "pct2ResTime" : 4536.35,
    "pct3ResTime" : 4541.0,
    "throughput" : 0.7722902266671816,
    "receivedKBytesPerSec" : 27.368034907518247,
    "sentKBytesPerSec" : 0.6900835521488976
  },
  "POST Login Klien-0" : {
    "transaction" : "POST Login Klien-0",
    "sampleCount" : 20,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1893.05,
    "medianResTime" : 1601.0,
    "minResTime" : 1056.0,
    "maxResTime" : 3491.0,
    "pct1ResTime" : 3244.2000000000003,
    "pct2ResTime" : 3478.85,
    "pct3ResTime" : 3491.0,
    "throughput" : 0.8432414200185513,
    "receivedKBytesPerSec" : 1.5308455076313348,
    "sentKBytesPerSec" : 0.8959440087697108
  },
  "POST Login Klien-1" : {
    "transaction" : "POST Login Klien-1",
    "sampleCount" : 20,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1754.9,
    "medianResTime" : 1881.5,
    "minResTime" : 803.0,
    "maxResTime" : 2582.0,
    "pct1ResTime" : 2507.6000000000004,
    "pct2ResTime" : 2579.1,
    "pct3ResTime" : 2582.0,
    "throughput" : 0.8279173738460901,
    "receivedKBytesPerSec" : 1.5272811710891252,
    "sentKBytesPerSec" : 0.7349383719004843
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 140,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2939.892857142856,
    "medianResTime" : 2343.5,
    "minResTime" : 48.0,
    "maxResTime" : 9192.0,
    "pct1ResTime" : 6496.800000000001,
    "pct2ResTime" : 8171.949999999998,
    "pct3ResTime" : 9179.7,
    "throughput" : 4.207110015926917,
    "receivedKBytesPerSec" : 89.27504474749827,
    "sentKBytesPerSec" : 4.590374921116687
  },
  "POST Login Klien-2" : {
    "transaction" : "POST Login Klien-2",
    "sampleCount" : 20,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3627.4500000000003,
    "medianResTime" : 3619.0,
    "minResTime" : 2641.0,
    "maxResTime" : 4768.0,
    "pct1ResTime" : 4600.5,
    "pct2ResTime" : 4759.8,
    "pct3ResTime" : 4768.0,
    "throughput" : 0.7698822080221726,
    "receivedKBytesPerSec" : 27.28270074678574,
    "sentKBytesPerSec" : 0.6879318558010624
  },
  "POST Login Klien" : {
    "transaction" : "POST Login Klien",
    "sampleCount" : 20,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 7278.1,
    "medianResTime" : 7514.0,
    "minResTime" : 4919.0,
    "maxResTime" : 9192.0,
    "pct1ResTime" : 9126.900000000001,
    "pct2ResTime" : 9190.5,
    "pct3ResTime" : 9192.0,
    "throughput" : 0.7060401736858828,
    "receivedKBytesPerSec" : 27.604516009460937,
    "sentKBytesPerSec" : 2.007801743919229
  }
}